{
  "controversial_talk": [
    "Is cereal soup?",
    "What's wrong with the current school system?",
    "What's the best and worst genre of music? Explain why",
    "Should animals be used for scientific or commercial testing?",
    "Should parents or other adults be able to ban books from schools and libraries?",
    "Should the death penalty be legal?",
    "Should the drinking age be lowered from 21 to a younger age in the United States?",
    "Should police officers be required to wear body cameras? Should anything else be required?",
    "Should prisons be privatized?",
    "How can we fix this prison system?",
    "Should humans colonize space?",
    "Do standardized tests improve education in America at all?",
    "Is sexual orientation a spectrum? Can it change overtime?",
    "Is censorship ever justified?",
    "Is globalization a force for good?",
    "Is there a gender wage gap?",
    "Should the government provide universal basic income?",
    "Is spanking an acceptable form of discipline for children? If not, what is?",
    "Is capital punishment morally justifiable?",
    "Should hate speech be protected under free speech?",
    "Should the government regulate big tech companies?",
    "Is political correctness helpful or harmful?",
    "Is abortion morally justifiable?",
    "Should hate crimes be punished more severely than regular crimes?",
    "Should the government regulate sugary drinks?",
    "What is Maxfecteau?",
    "What is The Mighty Chicken?",
    "What is Doubledevelo?",
    "What is eve?",
    "Is it ethical for companies to use personal data for targeted advertising?",
    "Should the government regulate the use of facial recognition technology?",
    "Should the government regulate the use of pesticides and other chemicals in agriculture?",
    "Is it ever ethical for companies to use sweatshop labor in developing countries?",
    "Should the government provide financial assistance to small businesses?",
    "Should young people have role models? Are they necessary?",
    "Should we prioritize economic growth over environmental protection?",
    "Is it ever justified to use violence for political change?",
    "Is it ethical for companies to profit from the prison industry?",
    "Is there a way to achieve true world peace?",
    "Should there be limits on how much money political campaigns can spend?",
    "Should there be limits on the number of children a person can have?",
    "Should governments be allowed to collect and use citizens' biometric data for security purposes?",
    "Is it ethical to use artificial intelligence in important decision-making processes?",
    "Should individuals have the right to sell their own organs for transplantation?",
    "Should governments be allowed to restrict access to the internet or social media during times of political unrest?",
    "Should public schools be required to teach coding and computer science?",
    "What's your favorite things about Brobot?",
    "List your ten favorite qualities about Brobot!",
	"Is salsa a type of salad dressing?",
	"What are the pros and cons of homeschooling?",
	"What's your least favorite music genre? What's the appeal of that genre?",
	"Should there be restrictions on the sale and consumption of spicy foods?",
	"Is it ever acceptable for individuals or groups to engage in vigilantism?",
	"What are the benefits and drawbacks of a cashless society?",
	"How can we address income inequality and poverty in society?",
	"Is it ethical for companies to use artificial intelligence to replace human workers?",
	"What is the importance of gender identity?",
	"What are the potential consequences of climate change, and how can we mitigate them?",
	"Should there be limits on the amount of wealth that individuals or corporations can accumulate?",
	"Is it ever acceptable to break the law in order to protest or raise awareness about an issue?",
	"How can we ensure equal rights and opportunities for all people regardless of their race, ethnicity, gender, or other characteristics?",
	"What are the most effective ways to address mental health issues in society?",
	"Is it acceptable to recline your seat on an airplane?",
	"When is it appropriate to wear pajamas in public?",
	"Is it ethical to eat meat?",
	"Should there be a limit on the number of pets someone can own?",
	"When is it acceptable to cheat on a test or exam?",
	"When is it okay to ghost someone?",
	"Should voting be mandatory and why or why not?",
	"Is it acceptable to use a phone while driving?",
	"When is it okay to lie in a job interview?",
	"Do you think tipping should be abolished in restaurants?",
	"Should parents be allowed to choose the gender of their unborn child?",
	"Should beauty pageants exist?",
	"Why shouldn't fast food restaurants be required to display calorie counts on their menus?",
	"When is it appropriate to use profanity in public?",
	"Why do some people believe that climate change is not real?",
	"Why do some people oppose same-sex marriage?",
	"Why do some people believe that the moon landing was faked?",
	"Why do some people believe that the Holocaust did not happen?",
	"Why do some people believe that the COVID-19 pandemic is a hoax?"
  ],
  "philosophy": [
    "Does consciousness continue after physical death?",
    "What makes human life so valuable?",
    "Why should we live?",
    "What are the benefits of being mortal?",
    "Do all people deserve a second chance?",
    "Where do emotions come from?",
    "Is ignorance really bliss?",
    "Can predestination and free will coexist?",
    "What does it mean to be happy?",
    "Can you be happy when faced with suffering?",
    "Can you be happy no matter the situation?",
    "Is happiness universal or a matter of perspective?",
    "How much should we care about making ourselves happy?",
    "Is it possible to feel happy and sad at the same time?",
    "What brings true happiness?",
    "What makes something immoral?",
    "Should all actions have equal consequences?",
    "Is slavery ever ethically defensible?",
    "Are we obligated to help others?",
    "Are those in better situations obligated to help the less fortunate?",
    "What makes someone fall in love?",
    "What would happen if we lived forever?",
    "Could immortality be possible?",
    "Should terminally ill patients be able to choose death?",
    "Why is it acceptable to kill insects?",
    "Can torture be justified?",
    "How much control should individuals have over their own bodies?",
    "Who has the ultimate responsibility for protecting human rights?",
    "What makes a country democratic?",
    "Should the will of the people always be followed?",
    "What role do political parties play?",
    "Should citizens obey unjust laws?",
    "Is wealth redistribution morally correct?",
    "What makes a crime a crime?",
    "What are the limits of science?",
    "Where did all matter come from?",
    "Is there a soul?",
    "Is 'fair' the same for everyone? Who determines whether or not something is “fair”?",
    "What makes you you?",
    "Is fate real?",
    "Can time be altered?",
    "Is there a cause for every effect?",
    "How do you know you’re not dreaming right now?",
    "Are insects conscious of life?",
    "What makes something humorous to some and not to others?",
    "Where does humor come from?",
    "If you try to fail and do, did you actually succeed?",
    "Is there an end of knowledge?",
    "Is everything subjective?",
    "Can something be created from nothing?",
    "Is there such thing as absolute truth?",
    "Is there such a thing as perfection?",
    "Where does fear come from?",
    "Does pain exist in itself or just our perception of it?",
    "What is hope?",
    "Why do humans laugh?",
    "Is it ethical to genetically modify human beings?",
    "What is the relationship between morality and religion?",
    "Is consciousness a product of the brain or something more?",
    "What is the role of art in society?",
    "What is the role of philosophy in everyday life?",
    "Is philosophy worth it?",
    "What is the meaning of freedom?",
    "Is it possible to be completely free?",
    "Is it ever morally justifiable to lie?",
    "Is a purpose in life necessary?",
    "Is forgiveness always necessary and appropriate?",
    "Is there such a thing as a just war?",
    "What is the meaning of justice?",
    "Is it possible to have an unbiased opinion?",
    "What really is love?",
    "Is there such a thing as free will?",
    "Is it better to live a life of pleasure or a life of meaning and purpose?",
    "Can we ever escape the cycle of suffering and find true enlightenment, or is this a delusion?",
    "Can we ever truly understand the nature of time, or is it an elusive and mysterious concept that eludes our grasp?",
    "Is multiculturalism an ideal worth striving for, or does it threaten to erode the unique identities of different cultures?",
    "Is it possible to create a universal ethical system that is applicable to all cultures and societies, or is ethical relativism a necessary reality?",
    "Can language shape the way we think and perceive the world, or are our thoughts and perceptions independent of the language we use?",
    "Can cultural diversity lead to innovation and progress, or does it inevitably lead to conflict and strife?"
  ]
}